# GetTransform Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssemblyInstance..::..GetTransform Method
AssemblyInstance Class See Also
---
Gets the origin of the assembly instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public Transform GetTransform()
```

Visual Basic
---
```text
Public Function GetTransform As Transform
```

Visual C++
---
```text
public:
Transform^ GetTransform()
```

# ### Return Value
The origin of the assembly instance.
# See Also
AssemblyInstance Class
Autodesk.Revit.DB Namespace